code/buffer/load-tests/scenarii/ping.yml
config:
  environments:
    dev:
      target: 'https://xc3ku17l3m.execute-api.eu-west-1.amazonaws.com/dev'
      defaults:
        headers:
          Accept: "application/json"
          Content-type: "application/json"
  phases:
    - duration: 5
      arrivalRate: 3
scenarios:
  - name: "Just ping the API"
    flow:
      - get:
          url: "/"